// function add(num1, num2){
//     return num1 + num2
// }
// const total = add(15, 17);
// console.log(total); //  এমন করলে আমরা সাধারনত জানি 32 আউট পুট আসবে 


// function add(num1, num2){
//     if(num2 == undefined){  // যদি  এটা না করা হতো তাহলে নান দেখাইতো কারন আমরা দ্বিতীয় পেরামিটারের রেজাল্ট নিচে উল্লেখ করিনাই । এটার মানে হলো যদি নাম2 এর মান আনডিফাইন থাকে তাহলে এর মান সরাসরি 0  হয়ে পরের টার সাথে যোগ হবে 
//         num2 = 0;
//     } 
//     return num1 + num2
// }
// const total = add(15);
// console.log(total);


function add(num1, num2){
    num2 = num2 || 0; // এটার মানে হলো যদি মান নিচে থাকে তাহলে তাই আসবে কিন্তু যদি তা না থাকে তাহলে 0 জাবে । তবুও নান দেখাবেনা  । এখানে যদি 0 এর পরিবর্তে 10 ও লেখি তাহলে যদি নিচে সংখ্যা না দেওয়া থাকে তাহলে 10 চলে যাবে। এর পরিবর্তে 10 ও লেখি তাহলে যদি নিচে সংখ্যা না দেওয়া থাকে তাহলে 10 চলে যাবে
    return num1 + num2
}
const total = add(15);
console.log(total);


function add(num1, num2 = 0){   // এটার মানে হলো যদি মান নিচে থাকে তাহলে তাই আসবে কিন্তু যদি তা না থাকে তাহলে 0 জাবে । তবুও নান দেখাবেনা  । এখানে যদি 0 এর পরিবর্তে 10 ও লেখি তাহলে যদি নিচে সংখ্যা না দেওয়া থাকে তাহলে 10 চলে যাবে। এর পরিবর্তে 10 ও লেখি তাহলে যদি নিচে সংখ্যা না দেওয়া থাকে তাহলে 10 চলে যাবে

    return num1 + num2
}
const total = add(15);
console.log(total);