// const ages = [12, 14, 16, 13, 17];
// const ages2 = [15, 16, 12];
// const ages3 = [25, 36, 22, 29];
// const allAges = ages.concat(ages2).concat([55]).concat(ages3).concat(ages);  // উপরের সবগুলা বেলুর মান যদি আমি িএকসাথে দেখাতে চাই তালে আমাকে এই কাজ গুলা করতে হবে। এবং এইগুলার বিতরে যদি নতুন সংখ্যা এড করতে চাইতহালে .concat([55]) এইভাবে এড করা যাবে । 
// console.log(allAges);

// const allAges2 = [ages, ages2, 5, ages3]
// console.log(allAges2); // [ [ 12, 14, 16, 13, 17 ], [ 15, 16, 12 ], 5, [ 25, 36, 22, 29 ] ]  এটা হবে আউট পুট । যদি এ ইভাবে করি তাহলে রকম দেখাবে কিন্তু আমরা যদি সবগুলা এক রকম করতে চাই তাহলে আমাদের কে ... তিনটা ডট দিতে হবে নিচের টার মত

// const allAges3 = [...ages, ...ages2, 5, ...ages3];  // আমরা যদি কোন সংখ্যা এড করতে চাই তাহলে আমাদের এই করকম করে করতে হবে তাহলে প্রথমটার মত আসবে আমাদের অনেক কমও লেখা লাগবে
// console.log(allAges3);



// const business = 650;
// const minister = 450;
// const sochib = 250;
// const maximum = Math.max(business, minister, sochib); কোন সংখ্যা যদি এই ভাবে একটা একটা করে থাকে তাহলে আমরা এই গুলাকে এই রকম করে লেখতে পারি কিন্তু যদি আমাদের বলা হয় এক বেরিয়েবল  ডিকলার করার পরে কিভাবে সেইখান থেকে বেস্ট মান টা বের করা যাবে তাহলে আমরা যা করবো
// console.log(maximum)

const takaPoisa = [650, 450, 250];
const maximum = Math.max(...takaPoisa);  // এই ভাবে ... দিয়ে দিলেই হয়ে যাবে। আর যদি ডট না দেই তাহলে নান দেখাবে। িএইরকম করলে একটা এরের সকল মানের সর্বচ্চো মান টা আসবে।
console.log(maximum);
